# 网络交换与路由技术



## 1. 交换网络管理技术🧐



### 1.1 交换机管理方式

1. 带外管理

   ​	将PC机上的COM口和交换机上的console口相连进行管理。Console口又分为(RJ45和DB9两个类型)。

2. 带内管理

   ​	通过Telnet，Web，SNMP进行远程管理。

---

### 1.2 交换机配置命令模式

   1. EXEC模式

      ​	用户模式 Switch >       (enable 进入特权模式)

      ​	特权模式 Switch #       (类似root权限)

      ```shell
      configure terminal           (进入全局配置模式)
      exit                         (后退一步)
      ```



   2. 配置模式

      ​    全局配置模式Switch(config) #       (配置交换机的整体参数)

      ​	接口配置模式Switch(config-if) #       (配置交换机的接口参数)
      ```shell
      interface fastethernet0/1   (进入接口配置模式)
      exit                         (后退一步)
      ```




* 配置远程登陆密码  Switch(config) #
```shell
enable secret level 1 0 ruijie
```
* 配置特权模式密码  Switch(config) #
```shell
enable secret level 15 0 ruijie
```
* 为交换机配置管理IP(方便远程操作交换机，避免带外管理)  Switch(config) #
```shell
interface vlan 1       (进入vlan 1)
no shutdown            (思科路由器默认端口都是关闭的，如果你配置了ip地址，想要激活这个端口，就需要输入no shutdown命令)
ip address 192.168.1.1 255.255.255.0     (配置IP地址和网关)
```
* 保存配置(将当前运行的参数保存到**flash**中用于系统初始化参数) Switch #
```shell
copy running-config startup-config      (把当前设备的运行配置保存到flash上去，以便下一次重启后系统能够还原到当前配置)
write memory        (把当前的配置已写入NVRAM中)
write               (把当前配置写入NVRAM保存，覆盖当前的启动配置)
```
* 删除配置 Switch #
```shell
delete flash:config.text     (永久删除Flash中不需要的文件)
no  XXX配置命令               (删除当前配置)
```
* 查看配置文件内容 Switch #
```shell
show configure           (查看保存在Flash里的配置信息)
show running-config      (查看RAM里当前生效的配置信息)
```

---

### 1.3 VLAN技术

​			可以对网络进行一个安全的隔离，分割广播域。

1. VLAN概述

   ​	VLAN是划分出来的逻辑网络，是第二层网络。

   ​	VLAN端口不受物理位置的限制。

   ​	VLAN隔离广播域。
   
2. VLAN的种类

    1. 基于端口的VLAN 
      
       **Port VLAN**
      
       ​	通过交换机与主机的端口连接，一个端口只属于一个VLAN。
      
       ​	通过查找MAC地址表，交换机对发往不同VLAN的数据不进行转发。
       
	   ![download.png](http://yanxuan.nosdn.127.net/c44106878b05435e8a1262cbe58ca919.png)
    
    * 创建VLAN10,将它命名为test
       ```shell
       enable                   (进入特权模式)
       configure terminal       (进入全局配置模式)
       vlan 10                  (创建VLAN 10)
       name test                (取名为 test)
       end                      (回到用户模式)
	   ```
      
    * 把接口 0/10加入VLAN10
       ```shell
       configure terminal
       interface fastethernet0/10     (配置百兆10接口)
       switchport mode access          (将该端口模式设置为trunk模式)
       switchport access vlan 10       (将端口划分到vlan10)
       end
       ```
       
    * 把一组接口加入某个VLAN (批量)
       ```shell
       interface range fastethernet0/1-8 ,0/15,0/20
       <!连续接口 0/1-8,不联系接口用逗号隔开，写明模块编号>
       switchport access vlan 10       (将端口划分到vlan10)
       end
       ```
       
       **Tag VLAN**
       
       ​	特点: 传输多个VLAN信息，实现同一VLAN跨越不同交换机，要求Trunk至少要***100M***。
       
       ![q1.png](http://yanxuan.nosdn.127.net/62128eb2396cc4ab92f8f58ec94a7c65.png)
       
       ![q2.png](http://yanxuan.nosdn.127.net/581e5382a170f0da2d5aa38c36070014.png)
       
       ![q3.png](http://yanxuan.nosdn.127.net/8325c67bc5e709f6203c048f61a0bd2e.png)
       
       802.1Q工作特点：
       
        * 802.1Q数据帧传输对于用户是完全透明的。(不安全)
       
        * Trunk 上默认转发交换机上存在的所有VLAN数据。
       
        * 交换机在从Trunk口转发数据前会在数据前打上Tag标签，在到达另一交换机后，再剥去此标签。



 * 把Fa 0/1 配置成Trunk口 :
   
    ```shell
    enable
    configure terminal
    interface fastethernet0/1
    switchport mode trunk
    end
    ```
 * 把端口Fa 0/20 配置成Trunk端口，但不包含VLAN2 :
   
    ```shell
    enable
    configure terminal
    interface fastethernet0/20
    switchport trunk allowed vlan remove 2    (TRUNK上可以允许通信的VLAN,除了VLAN2)
    end
    ```
 * 配置VLAN 20 为Trunk :
   
    ```shell
    enable
    configure terminal
    interface fastethernet0/20
    switchport trunk native vlan 20     (为数据打上native vlan 20标签进入交换机传输)
    end
    !!每个Trunk口的缺省native VLAN是VLAN 1。
    !!在配置VLAN链路时，情确保连接链路两端的Trunk口属于相同的native VLAN。
    ```
 * 验证配置信息 :
   
    ```shell
    show interfaces fastethernet0/20
    show vlan
    ```
 * 将VLAN信息保存到Flash :
   
    ```shell
    enable
    write memory
    ```
 * 从Flash中只清除VLAN信息 :
   
    ```shell
    enable
    delete flash:vlan.dat
    ```
 * 从RAM中删除VLAN :
   
    ```shell
    enable
    configure terminal
    no vlan VLAN-id
    ```
    
    
    2. 基于协议的VLAN
      
    3. 基于MAC地址的VLAN
      
    4. 基于组播的VLAN
      
    5. 基于IP子网的VLAN

---



### 1.4 交换网络中的冗余链路

因网络中的单点故障会导致网络无法访问（个人PC --> 交换机 --> 目标主机），我们常常会有冗余链路（备用链路）来解决单点故障的问题，也就是当主链路故障时，启用的备用方案。

* 但是冗余链路会形成一个网络环路，当交换网络中出现环路会产生广播风暴（严重消耗网络资源），多帧复制（？）和MAC地址表（交换机不知道从那个端口发给目标）不稳定等现象。



---



### 1.5 生成树协议STP

生成树协议的作用是为了提供冗余链路，解决网络环路的问题。

生成树协议通过SPA（生成树算法）生成一个没有环路的网络，当主要链路故障时，**自动**切换到备份链路，保证网络的正常通信。



#### 1.5.1 BPDU网桥协议数据单元

![k1.png](http://yanxuan.nosdn.127.net/510689b7872149ca10b44d852f392249.png)



​		**网桥协议数据单元**是一种**生成树协议**问候数据包，它以可配置的间隔发出，用来在网络的网桥间进行信息交换。

​		当一个网桥开始变为活动时，它的每个端口都是每2s（使用缺省定时值时）发送一个BPDU。然而，如果一个端口收到另外一个网桥发送过来的BPDU，而这个BPDU比它正在发送的BPDU更优，则本地端口会停止发送BPDU。如果在一段时间（缺省为20s）后它不再接收到邻居的更优的BPDU，则本地端口会再次发送BPDU。



1. 交换网络中**所有**交换机共同选举一台交换机为根交换机。
2. 所有**非**根交换机选择一条到达根交换机的**最短路径**。
3. 所有**非**根交换机产生一个到去**根**交换机的端口。（这个去根交换机的端口成为**根端口 Root Port**）。
4. 每个LAN都会选择一台设备为指定交换机，通过该交换机的端口连接到根。（这个连接LAN的端口称为**指定端口 Designated port**）。
5. 将交换网络中所有的设备的**根端口**和**指定端口**设置为转发状态（Forwarding），将其他端口设为阻塞状态（Blocking）。



#### 1.5.2 根交换机的选择

根交换机的选择原则：

* 所有的交换机首先认为主机是根。

* 这个交换网络选出 Bridge ID 最小的交换机为根交换机。

* Bridge ID：每个交换机唯一的桥ID，由交换机的优先级和MAC地址组合而成。

* 交换机的优先级和MAC地址越小则Bridge ID就越小。

* 默认优先级为32768（0x8000）。

  

#### 1.5.3 最短路径选择

选择最短路径时：

1. 先比较本交换机到达根交换机路径的开销。
2. 如果开销一样，就比较发送BPDU交换机的 Bridge ID。（优先级 + MAC地址）
3. 如果上面的一样，就比较发送者**交换机**的 Port ID。（1 Byte端口优先级 + 1 Byte端口ID，缺省值为128（0x80））
4. 如果还是一样，就比较**接收者**的 Port ID。



#### 1.5.4 生成树协议端口的状态

![k2.png](http://yanxuan.nosdn.127.net/554793266286f39ee59ee70d74821a90.png)



* Blocking 接收BPDU，不学习MAC地址，不转发数据帧
* Listening 接收BPDU，不学习MAC地址，不转发数据帧，但交换机向其他交换机通告该端口，参与选举根端口或指定端口
* Learning 接收BPDU，学习MAC地址，不转发数据帧
* Forwarding 正常转发数据帧



**~~个人理解~~**：在Blocking端口20秒的时间内，没有收到BPDU，该端口就会向外发送BPDU，此时端口改变为Listening状态，此时整个网络拓扑进行根交换机以及根端口和指定端口的选举，再选出根端口，指定端口和根交换机后，状态变为Learning，此时根交换机和别的交换机学习MAC地址，以便拓扑成型后转发数据报文，学习完成后，对应的端口变成Forwarding或Blocking状态。



#### 1.5.5 缺点

在一个大中型网络中等整个网络拓扑稳定下来需要约50秒！



---



### 1.6 快速生成树协议RSTP

在STP上做了改进，使收敛速度快得多。

整个网络拓扑成型大约需要1秒。

#### 1.6.1 RSTP端口角色和端口状态

* Root Port  （到根交换机的最短路径的端口）
* Designated Port  （LAN通过该端口连接到根交换机）
* Alternate Port  （根端口的替换口，备用根端口）
* Backup Port  （指定端口的备份口，当一个交换机由两个端口都相连接在一个LAN上，那么指定端口的优先级高于Backup Port）
* Undesignated Port  （不活跃的口，即OperState为down的端口都被分配这个角色）



---



### 1.7 多生成树协议MSTP

​		将环路网络修剪成为一个无环的树型网络，避免报文在环路网络中的增生和无限循环，同时还提供了数据转发的多个冗余路径，在数据转发过程中实现VLAN 数据的负载均衡。MSTP 兼容STP 和RSTP，并且可以弥补STP 和RSTP 的缺陷。它既可以快速收敛，也能使不同VLAN 的流量沿各自的路径分发，从而为冗余链路提供了更好的负载分担机制。

![k3.png](http://yanxuan.nosdn.127.net/6e4e73cc98d4a78b5b9a94453bd44166.png)



---



### 1.8 配置STP，RSTP



开启生成树协议   Switch(config)#

```shell
Spanning-tree
```

关闭生成树协议   Switch(config)#

```shell
no Spanning-tree
```

配置生成树协议的类型   Switch(config)#

```shell
Spanning-tree mode stp/rstp   (锐捷系列交换机默认使用MSTP协议)
```

配置交换机优先级   Switch(config)#

```shell
spanning-tree priority <0-61440>
(优先级的值要是 “0”或“4096”的倍数，共16个，缺省值为32768)
```

恢复到缺省值   Switch(config)#

```shell
no spanning-tree priority
```

配置交换机端口的优先级   Switch(config)#

```shell
interface interface-type(百兆口还是千兆口) interface-number(端口优先级的值)
spanning-tree port-priorty number(优先级的值)
```

![k4.png](http://yanxuan.nosdn.127.net/4d14052c7993ced796d5b7539a824d10.png)



显示生成树状态   Switch#

```shell
show spanning-tree
```

显示端口生成树协议   Switch#

```shell
show spanning-tree interface fastethernet <0-2/1-24>
```



---



### 1.9 以太网链路聚合

因为交换网络中的需求量大，带宽无法满足用户应用的需求就出现了链路聚合。

**定义**：端口聚合（又称为链路聚合），将交换机上的 多个端口在物理上连接起来，在逻辑上捆绑在一起，形成一个拥有较大带宽的端口，可以实现负载分担，并提供冗余链路。

不同的设备支持的最多聚合端口组不定。比如锐捷交换机最多支持8个物理端口组成一个聚合端口组。

**流量平衡**：Aggregate port（AG）可以根据报文的源MAC地址，目的MAC地址或IP地址进行流量平衡，即把流量平均地分配到AG组成员链路中去。

![L1.png](http://yanxuan.nosdn.127.net/22ed66f95abcadc849a797b41854f242.png)



#### 1.9.1 链路聚合的注意事项

* 组端口的速度必须一致
* 组端口必须属于同一个VLAN
* 组端口使用的传输介质相同
* 组端口必须属于同一个层次，并与AG也要在同一个层次



将该端口加入一个AG   Switch#

```shell
configure terminal
interface interface-type(端口类型) interface-id(端口id)
port-group port-group-number(组端口数字)   --如果这个AG口不存在，可自动创建AG端口
```

查看聚合端口的汇总信息   Switch#

```shell
show aggregateport summary
```

查看聚合端口的流量平衡方式   Switch#

```shell
show aggregateport load-balance
```



---



## 2. IP子网间的路由技术🐰



### 2.1 路由器的管理方式

* 带外管理
* 带内管理
  1. Telnet
  2. Web
  3. SNMP工作站

---



### 2.2 路由器的基本配置



进入特权模式   Router>

```shell
enable     --从Router >变成Router #
```

进入全局模式   Router#

```shell
configure terminal     --从Router #变成Router(config)
```

进入到线路配置模式   Router(config)#

```shell
Line vty 0 4       --从Router(config)#变成Router(config-line)#
```

进入到路由配置模式   Router(config)#

```shell
router rip           --从   到Router(config-router)#
```

进入接口配置模式   Router(config)#

```shell
Interface f 1/1       --从   到Router(config-if)#
```



#### 2.2.1 路由器上配置telnet(配置路由器的端口地址)



进入路由器接口配置模式   Router(config)#

```shell
interface fastethernet 1/0
```

配置路由器管理接口IP地址   Router(config-if)#

```shell
ip address 192.168.0.1 255.255.255.0
```

开启路由器f 1/0接口   Router(config-if)#

```shell
no shutdown
```



#### 2.2.2 路由器上配置telnet(配置远程登陆密码)

进入路由器线路配置模式   Router(config)#

```shell
line vty 0 4
```

配置远程登陆   Router(config-line)#

```shell
login
```

设置路由器远程登陆密码为 abcd   Router(config-line)#

```shell
password abcd
```



#### 2.2.3 路由器上配置telnet(配置路由器特权模式密码)

设置路由器特权模式密码为 aaaa   Router(config)#

```shell
enable secret aaaa           --存储的时候加密
或者
enable password aaaa         --存储的时候不加密
```



#### 2.2.4 路由器配置文件的管理

 查看配置文件

```shell
show version     --查看版本以及引导信息
show running-config    --查看运行配置
show startup-config    --查看用户保存在NVRAM中的配置文件
```

保存配置文件 Router#

```shell
copy running-config startup-config
write memory
write
```

删除配置文件 Router#

```shell
delete flash:config.text         --删除初始配置文件
```



---



### 2.3 路由原理

路由器是连接网络与网络的，只能帮我们找到目标网络，不能帮我们找到目标主机。

==基本概念：==

* 定义：路由器从管理员的配置或者通过路由选择协议，从其他路由器那里学习到的路径称之为路由。
* 路由前提：激活协议(路由协议和本身的网络协议)，目的网络，最佳接口。
* 路由表：由路由协议生成。
* 管理距离：标识尺度。（如果路由协议管理的距离越小，代表越可靠)
* 度量值：总开销。
* 相邻关系：接收，处理，分析，修改IP包头。



路由表包括路由信息源，目的网络，转发端口。

![L2.png](http://yanxuan.nosdn.127.net/9f781ecd0c60b2ee4821d8a7e453803e.png)



---



#### 2.3.1 路由信息

显示当前的路由表   Router#

```shell
show ip route
```

![Y1.png](http://yanxuan.nosdn.127.net/4ddca5e64b682c8a846710ccf805553c.png)

> C 代表直连

> O 代表路由协议，OSPF学习到的

>S* 静态路由(缺省路由)  人为配置的



![Y2.png](http://yanxuan.nosdn.127.net/0c8610ae18688f6fce830fed087b22d2.png)

上面的172.168.8.0是目标网络号，不是某一个IP地址。

管理距离==越小越可信==。

度量值==越小开销越小==。

为了保证路由器的路由表是最新的信息，到一定时间，改路由线路未更新，就失效删除。

Serial 串口，广域口，从路由器的哪个端口转发出去。

---



#### 2.3.2 优先路由路线

* 管理距离可以用来选择采用哪个IP路由协议

* 管理距离值越低，学到的路由越可信

  1. 静态配置路由优先于动态协议学到的路由（一般情况下）
  2. 采用复杂量度的路由协议优先于简单量度的路由协议

常见的管理距离：


![Y3.png](http://yanxuan.nosdn.127.net/0aebdd895f782e0038b61c145605205c.png)



路由决策原则：

1. 最长匹配
   * 例：10.0.0.0/8  和  10.1.0.0/16   ==选择更具体更详细的路由==
2. 根据路由的管理距离：管理距离越小，路由越优先
   * 例：S 10.0.0.0/8  和  R 10.0.0.0/8  ==S(人为配置)的比R(动态学习到的)可信==
3. 管理距离一样，就比较路由的度量值(metric)，越小越优先
   * 例：S 10.0.0.0/8 [1/20]  和  S 10.0.0.0/8 [1/40]  ==开销更小(这个情况还有备用路由的原因)==

---

静态路由配置：

1. 设计拓扑（搭建网络）

2. 为路由器和PC配置IP地址，并且==逐段测试链路的连通性==。

3. 查看一下路由器的直连路由

4. 为所有的非直连的网络配置静态路由

   ip route [目标网络号] [掩码] [下一跳路由器的接口地址/本地转发接口]

5. 重新检查路由表并测试连通性

优点：简单高效
缺点：不够灵活，不能自适应网络的变化

缺省路由：(任何一个目标地址都与它匹配)

ip route 0.0.0.0 0.0.0.0 [下一跳路由器的接口地址/本地转发接口]  <——  一般为上级ISP

---



### 2.4 RIP路由协议

RIP（Routing Information Protocols）是应用较早，使用较普遍的内部网关协议（Interior Gateway Protocol，检查IGP）。适用于小型同类网络，是典型的距离矢量协议。

RIP是基于UDP，端口520的应用层协议。

RIP路由协议的版本：

> **==RIPv1==**
>
> * 有类路由协议，不支持VLSM
> * 以广播的形式发送更新报文
> * 不支持认证（不安全）

> **==RIPv2==**
>
> * 无类路由协议，支持VLSM
> * 可以人工设定是否进行自动路由汇总
> * 支持明文和MD5的认证
> * 使用多播来代替RIPv1中的广播，RIPv2使用多播地址224.0.0.9来更新路由信息

==度量值==：RIP协议是以跳数来衡量到达目的网络的度量值(metric).

![L4.png](http://yanxuan.nosdn.127.net/d6ddd17d29d343531e56a2501444d15c.png)

> RIP协议假定如果从网络的一个终端到另一个终端的路由跳数超过15个，将被认为是不可到达的。



#### 2.4.1 RIP协议的工作原理

1. RIP启动时的初始RIP Database仅包含本路由器声明的路由。
2. RIP协议启动后向各个接口广播或组播一个**==REQUEST==**报文。
3. 邻居路由器的RIP协议从某接口收**==REQUEST==**报文，根据自己的RIP Database，形成**==Update==**报文向该接口对应的网络进行广播。
4. RIP接收邻居路由器回复的包含邻居路由器RIP Database的**==Update==**报文，形成自己的RIP Database。
5. RIP的Metric以Hop为计算标准，最大有效跳数为15跳，16跳为无穷大代表无效。

----



#### 2.4.2 RIP路由信息的更新

当A直连的网络拓扑发生变化后，A路由器更新路由表，等到下一个发送周期通告更新后的路由器，路由器B收到更新消息后更新B的路由表。

![L5.png](http://yanxuan.nosdn.127.net/f5670a1f06b4ad22a9c4985af8698c29.png)

RIP依赖3种定时器维护其数据库：

1. 更新定时器---30秒
2. 路由失效定时器---180秒（只是失效暂时还未删除）
3. 清除路由条目时间---240秒（在路由表中删除）

---



#### 2.4.3 配置RIP协议

**配置步骤：**

1. 开启RIP路由协议进程   Router(config)#

   ```shell
   router rip
   ```

2. 申请本路由器参与RIP协议的直连网段信息   Router(config-router)#

   ```shell
   network XXX.XXX.XXX.XXX
   ```
3. 指定RIP协议的版本2（默认是version 1）   Router(config-router)#

   ```shell
   version 2
   ```
4. 在RIPv2版本中关闭自动汇总   Router(config-router)#

   ```shell
   no auto-summary
   ```
5. 在接口下进行手动的路由汇总  Router(config-if)#

   ```shell
   ip summary-address rip {ip-address} {mask}
   ```



**查看RIP配置信息：**

1. 验证RIP的配置  Router#

   ```shell
   show ip protocols
   ```
2. 查看路由表的信息  Router#

   ```shell
   show ip route
   ```
3. 清除IP路由表的信息  Router#

   ```shell
   clear ip route
   ```
4. 在控制台显示RIP的工作状态  Router#

   ```shell
   debug ip rip
   ```

#### 附加：关闭域名查找功能

敲错命令的话，会等待寻找错误命令的域名的超时时间。

关闭的命令   Router(config)#

```shell
no ip domain-lookup
```

---



### 2.5 OSPF路由协议

​		

​		OSPF路由协议是一个链路状态协议，其使用最短路径优先算法（SPF）计算路由。

​		目前有OSPFv1（实验用），OSPFv2（发行版），OSPFv3（支持IPv6）这三个版本。

---



#### 2.5.1 OSPF的特点

 * 可适应大规模网络
 * 路由变化收敛速度快
 * 无自环
 * 支持变长子网掩码VLSM (无类路由)
 * 支持等值路由
 * 支持验证
 * 支持区域划分
 * 支持以组播地址发送协议报文
 * 提供路由分级管理

---



#### 2.5.2 OSPF与RIP的比较

* OSPF没有跳数限制，RIP只有15跳

* OSPF理解变长子网掩码并支持汇聚

* OSPF收敛速度比RIP快得多，因为OSPF在网络变化时**立即**发送更新

* OSPF最多或支持六条相同代价路径和负载均衡

* OSPF具有认证功能，RIPV2也有，RIPV1没有

* OSPF在检测和故障排除上有比RIP好得多的IOS工具库

  

* ==缺点：==配置复杂，技术要求高，吃内存和CPU

---



#### 2.5.3 OSPF包头格式

![d1.png](http://yanxuan.nosdn.127.net/e4014bf7abf3653db7f095959d7bf014.png)

---



#### 2.5.4 OSPF运行过程



1. 每个运行OSPF的路由器发送 Hello 报文到所有启用OSPF的接口。如果在共享链路上两个路由器发送的 Hello 报文内容一致，那么这两个路由器将形成邻居关系。
2. 在这些邻居关系中，部分路由器形成邻接关系。邻接关系的建立由OSPF路由器交换 Hello 报文和网络类型来决定。
3. 形成邻接关系的每个路由器都宣告直接的所有链路==状态==。
4. 每个路由器都接受邻居发送过来的 LSA ，记录在自己的链路数据库中，并将链路数据库的一份拷贝发送给其他的邻居。
5. 通过在一个区域中泛洪，使得给区域中的所有路由器同步自己的数据库。
6. 当数据库同步之后，OSPF通过SPF算法，计算到目的地的最短路径，并形成一个以自己为根的无自环的最短路径树。
7. 每个路由器根据这个最短路径树建立自己的路由转发表。

---



#### 2.5.5 OSPF重要的数据库



邻居数据库：路由表与邻居路由器的双向列表                       

> Router# show ip ospf neighbor



拓扑结构数据库（链路状态数据库）：所有路由器都有相同的链路状态数据库

> Router# show ip ospf database



路由表（转发数据库）：当对链路状态数据库运行 SPF 算法后，所产生的路由列表，里面有如何以及去哪儿对其他路由器发送数据包有关的信息

> Router# show ip route ospf

---



#### 2.5.6 OSPF综述

![d4.png](http://yanxuan.nosdn.127.net/961be0d75f5d0d6d57fc32b9fc7259a7.png)

![d2.png](http://yanxuan.nosdn.127.net/a3e31b39d80516c180172a36b587bf83.png)

![d3.png](http://yanxuan.nosdn.127.net/1beb071872bc74c5e3c5d921fd3f4cf0.png)



==**[SPF算法](https://www.sogou.com/tx?ie=utf-8&pid=sogou-site-1f2b8183cd1e469a&query=spf%E7%AE%97%E6%B3%95)**==

---

#### 2.5.7 OSPF的报文



1. HELLO 发现和建立邻居

2. DBD 交换LSA链路状态

3. LSR 链路状态请求报文

4. LSU 链路状态更新报文

5. LSACK 确认报文

   

---



#### 2.5.8 LSA的操作



![d5.png](http://yanxuan.nosdn.127.net/3618c16651e8fd769c9637048fec1fa0.png)



> OSPF LSA (Link-State Advertisement )是链路状态通告的意思




> LSA是一个PDU，协议数据单元，他是封装在LSU中传递，LSA一般会有序列号




1. 是否有被链路状态数据库记录 ，如果有就跳转 **<第7步>**
2. 添加到数据库
3. 发送 LSAck 包
4. 泛洪组播 LSA 修改各个路由器的路由表
5. 运行SPF去计算新的最短路径
6. ==结束==
7. 是否序列号相同，如果相同就忽略该 LSA，不相同就走下一步
8. ？



---

#### 2.5.9 OSPF接口状态



==DOWN==状态：没有与任何邻居交换信息

==INIT==状态：每10秒发送 HELLO 包

==TWO-WAY==双向状态：基本状态，当看到自己出现邻居路由器的 HELLO 数据包中时，它就进入双向状态

==EXSTART==准启动状态：两个邻居路由器用 DBD 数据包来协商主从关系，有最高OSPF路由器ID的路由器胜出为主

==EXCHANGE==交换状态：路由器相互描述它们的链路状态数据库

==LOADING==加载状态：接收（LSR状态请求包）-> 回应（LSU链路状态更新包）-> 确认（LSAck链路状态确认包）

==FULL ADJACENCY==全邻接状态：生成邻接数据库（邻居路由器列表），还有链路状态数据库（拓扑结构数据库）和转发数据库（路由表）生成



#### 2.5.10 OSPF邻接过程



> 1. 建立邻居关系（初始化）
>
>    * 建立双向通信（相互发送Router ID 和 IP 地址）
>    * 路由发现（由其他路由器向==根==路由器发送链路信息，然后==根==路由器再以组播的形式发送出去）
> 2. 增加 LSA 条目
>    *  ？
>





#### 2.5.11 单区域的OSPF配置



1. 创建loop接口，定义 Router ID

   ```shell
   routerA(config)#interface loopback 10
   routerA(config)#ip address 192.168.100.1 255.255.255.0
   ```



2. 开启OSPF进程，需自定义一个进程编号，进程编号只在该设备上有效

   ``` 
   routerA(config)#router ospf 10          -- 10表示进场编号，只在本设备有效
   ```



3. 申请直连网段（就是把与它相连的所有线路的网络号和==反掩码==都在该设备上输入一遍）

   ```shell
   routerA(config-router)#network 192.168.0.1(例子) 0.0.0.255(例子) area 0
   ```

   后面的area 0 表示 该设备是==逻辑上==定义在那个区域里面的

   

   > 这里给出常用的掩码和反掩码
   >
   > ![掩码和反掩码 (1).png](http://yanxuan.nosdn.127.net/2acec5b0b3955567aa8f982acf2d9e7d.png)
   > 
   >![掩码和反掩码 (2).png](http://yanxuan.nosdn.127.net/08330c04952c9d8a740feaaf7988a889.png)
   >
   >![掩码和反掩码 (3).png](http://yanxuan.nosdn.127.net/7470a4a7471417c0ebd76cd49525ba88.png)
   >
   >![掩码和反掩码 (4).png](http://yanxuan.nosdn.127.net/8d8d6acf5e6b5c33d99fd26d70448b28.png)



#### 2.5.12 OSPF的一些配置



手动设置Router ID

```shell
Router(config-router)#router-id ip-address
```

* 可以指定除 0.0.0.0 和 255.255.255.255 的任何地址作为 Router ID
* 需要使用  ==**`clear ip ospf process`**==  命令使之生效



手动修改 OSPF 的链路开销

```shell
Router(config-if)#ip ospf cost value
```



验证OSPF的配置

```shell
Router#show ip ospf
```



显示路由表的信息

```shell
Router#show ip route
```



清楚 IP 路由表的信息

```shell
Router#clear ip route
```



在控制台显示 OSPF 的工作状态

```shell
Router#debug ip ospf
```







## 3. 内网安全技术🦆



### 3.1 网络安全隐患

现有的网络完全防御体系:

1. 杀毒软件

2. IDS/IPS

3. 防火墙

4. ACL



### 3.2 交换机端口安全

因为存在MAC地址攻击，ARP攻击，IP/MAC地址欺骗等，所以需利用交换机的端口安全机制。



交换机端口安全的基本功能

* 限制交换机端口的最大连接数
* 端口的地址绑定



安全违例产生于以下情况:

* 一个端口被设置为安全端口，当连接的地址个数超过了允许的最大个数
* 该安全端口收到一个不是安全地址的(来历不明)包



产生安全违例后的处理方式

* Protect : 当安全地址个数满后，安全端口将丢弃==来历不明==的包（不属于安全端口的任意一个）
* Restrict : 当违例产生时，发送一个 Trap 通知
* Shutdown : 当违例产生时，将关闭端口并发送一个 Trap 通知



#### 3.2.1 配置安全端口



配置端口最大连接数

```shell
switchport port-security   ---打开该接口的安全功能
switchport port-security maximum value   ---设置接口上安全地址的最大个数，范围1-128，默认128
switchport port-security violation{ protect | restrict | shutdown }   ---设置处理违例的方式
```

==**！注意：**==

1. 端口安全功能只能在 access 端口进行配置
2. 当端口因为违例而关闭后，在全局模式下使用命令==`errdisable recovery`==来将接口从错误状态中恢复过来



---

端口的安全地址绑定

```shell
switchport port-security   ---打开该接口的端口安全功能
switchport port-security mac-address MAC地址 ip-address IP地址 ---手动配置接口上的安全地址 
```

==**！注意：**==

1. 端口安全功能只能在 access 端口进行配置

2. 端口的安全地址绑定方式有：单MAC，单IP，MAC+IP

   

==案例1==

> 将 Switch 的 gigabitethernet 0/1 口设置为端口安全功能，设置最大连接地址个数为8，设置违例方式为protect
>
> ```shell
> Switch# configure terminal
> Switch(config)# interface gigabitethernet 0/1
> Switch(config-if)# switchport mode access
> Switch(config-if)# switchport port-security
> Switch(config-if)# switchport port-security maximum 8
> Switch(config-if)# switchport port-security violation protect
> Switch(config-if)# end
> ```

   

==案例2==

> 将 Switch 接口 fastEthernet 0/2 口设置为端口安全功能，并且绑定某某地址和IP
>
> ```shell
> Switch# configure terminal
> Switch(config)# interface fastethernet 0/2
> Switch(config-if)# switchport mode access
> Switch(config-if)# switchport port-security
> Switch(config-if)# switchport port-security mac-address 00d0.f6a1.85c3 ip-address 192.168.3.1
> Switch(config-if)# end
> ```



#### 3.2.2 查看配置的信息



查看所有接口的安全统计信息，包括最大安全地址数，当前安全地址数已经违规的处理方式。

```shell
Switch# show port-security
```



只查看安全地址信息

```shell
Switch# show port-security address
```



---

### 3.3 IP访问控制列表



IP Access-List：IP访问列表或访问控制列表，简称ACL。就是对经过网络设备的数据包根据一定的规则进行过滤。

保证内网的安全和稳定。



访问控制列表规则可分为：

* 标准访问控制列表（根据数据包源IP地址进行规则定义）
* 扩展访问控制列表（根据数据包中源IP，目的IP，源端口，目的端口，协议进行规则定义）



使用时：先定义规则，再应用到指定的路由器或交换机上面就可以了。



#### 3.3.1 访问列表的入栈和出栈应用

数据包经过网络设备时可以分为：

* 入栈应用（in）---进入设备的数据包
* 出栈应用（out）---向外发送的数据包



==**一个接口在一个方向只能应用一组访问控制列表**==



![L6.png](http://yanxuan.nosdn.127.net/433eed97a0d13b921c282730c94b40c4.png)



![L7.png](http://yanxuan.nosdn.127.net/4323799428e8276f5c0490cb62eb86cb.png)



#### 3.3.2 IP ACL的基本准则



1. 一切未被允许的就是禁止的
   * 最终的默认规则就是拒绝所有数据包通过

2. 按规则链来进行匹配
   * 使用源地址，目的地址，源端口，目的端口，协议，时间段进行匹配

3. 规则匹配原则
   * 从头到尾，自顶向下的匹配方式
   * 匹配成功马上停止
   * 停止后立即使用该规则的“允许/拒绝等”



当匹配完所有的规则都不符合时，即为拒绝。



反掩码（通配符）

> 反掩码转化为2进制的话，其中的0所在的位置代表检查对应的地址比特，1所在的位置代表不检查对应的比特
>
> 192.168.5.0    0.0.0.255    表示检查前面的24位是否为192.168.5  后面的8位可以随便填 即为：==192.168.5.XXX==





#### 3.3.3 标准ACL的配置



1. 定义==标准==ACL

   * 编号的标准访问列表

     ```shell
     Router(config)#access-list <1-99> {permit|deny} 源地址 [反掩码]
     ```

   * 命名的标准访问列表

     ```shell
     switch(config)#ip access-list standard <name>
     switch(config-std-nacl)#{permit|deny} 源地址 [反掩码]
     ```



2. 应用ACL到接口

   ```shell
   Router(config)#int fa0/0  ---这里使用0/0口举例
   Router(config-if)#ip access-group <1-99> {in|out}
   ```

   



例子：

```shell
Router(config)#access-list 1 permit 172.16.3.0 0.0.0.255   ---允许172.16.3.X这个段通过
Router(config)#int fa0/1   ---以0/1口举例
Router(config-if)#ip access-group 1 out   ---应用于1号规则在out出栈应用上
```





---

#### 3.3.4 扩展的ACL的配置



1. 定义==扩展==的ACL

   * 编号的扩展ACL

     ```shell
     Router(config)#access-list <100-199> {permit|deny} 协议 源地址 [反掩码] [源端口] 目的地址 反掩码 [目的端口]
     ```

   * 命名的扩展ACL

     ```shell
     switch(config)#ip access-list extended {name} {permit/deny} 协议 源地址 反掩码 [源端口] 目的地址 反掩码 [目的端口]
     ```



2. 应用ACL到接口

   ```shell
   Router(config)#int fa0/0  ---这里使用0/0口举例
   Router(config-if)#ip access-group <100-199> {in|out}
   ```

   

例子：允许指定网络（192.168.X.X）的所有主机以HTTP访问服务器172.168.12.3，但拒绝其他所有主机访问

```shell
Router(config)#access-list 101 permit tcp 192.168.0.0 0.0.255.255 host 172.168.12.3 eq www
Router#show access-lists 101   ---查看创建的规则
```





#### 3.3.5 ACL的查看指令



显示全部的访问列表

```shell
Router#show access-lists
```



显示指定的访问列表

```shell
Router#show access-lists <1-199>
```



显示接口的访问列表应用

```shell
Router#show ip interface 接口名称 接口编号
```







---
## 4. 局域网与Internet互联🐸



局域网与Internet连接时，不可能每个人都有一个公网地址，这个时候就需要使用 NAT 技术。



实现 NAT 这一类服务，可以通过代理服务器（软件或者硬件）来完成。



---

### 4.1 NAT的工作原理

大致来说就是把一个 IP 地址转换成另外一个 IP 地址的技术。



NAT 的类型：

* NAT （Network Address Translation）
> 转换后，一个**本地 IP 地址**对应一个**全局 IP 地址**



* NAPT（Network Address Port Translation）
> 转换后，**多个本地地址**对应**一个全局 IP地址**



NAT的工作原理 （一对一的映射）

![s9.png](http://yanxuan.nosdn.127.net/8c4f966a74107a1f4982cf86eed564c6.png)



NAPT的工作原理（利用端口做一对多的映射）

![s10.png](http://yanxuan.nosdn.127.net/3fc8a77e0c16571670ff864f5fc09ea2.png)

这些情况，要用到 NAPT 技术：

* 缺乏全局 IP 地址，甚至没有专门申请的全局 IP 地址，只有一个连接 ISP 的全局IP地址
* 内部网要求上网的主机数很多
* 提高内网的安全性



---

### 4.2 NAT/NAPT的配置



NAT/NAPT 的配置有两种

* 静态 NAT/NAPT
  * 需要向外网提供信息服务的主机
  * 永久的一对一IP地址映射关系
* 动态 NAT/NAPT
  * 只访问外网服务，不提供信息服务的主机
  * 内部主机数可以大于全局IP地址数
  * 最多访问外网主机数决定于全局IP地址数
  * 临时的一对一IP地址映射关系



---

#### 4.2.1 静态NAT



1. 定义内网接口和外网接口

```shell
Router(config)# interface fastethernet 1/0
Router(config-if)# ip nat outside

Router(config)# interface fastethernet 1/1
Router(config-if)# ip nat inside
```

2. 建立静态映射关系

```shell
Router(config)# ip nat inside source static 192.168.1.7 200.8.7.3  --后面的IP地址根据实际的来变换
```



----

#### 4.2.2 静态NAPT

1. 定义内网接口和外网接口

```shell
Router(config)# interface fastethernet 0
Router(config-if)# ip nat outside

Router(config)# interface fastethernet 1
Router(config-if)# ip nat inside
```

2. 建立静态的映射关系

```shell
Router(config)# ip nat inside source static tcp 192.168.1.7 1024 200.8.7.3 1024
Router(config)# ip nat inside source static udp 192.168.1.7 1024 200.8.7.3 1024
IP地址和端口可以根据实际情况更改
```



---

#### 4.2.3 动态NAT配置

1. 定义内网接口和外网接口

```shell
Router(config)# interface fastethernet 1/0
Router(config-if)# ip nat outside

Router(config)# interface fastethernet 1/1
Router(config-if)# ip nat inside
```

2. 定义内部本地地址范围
```shell
Router(config)# access-list 10 permit 192.168.1.0 0.0.0.255
定义在内部进行NAT的地址范围
```

3. 定义内部全局地址池
```shell
Router(config)# ip nat pool abc 200.8.7.3 200.8.7.10 netmask 255.255.255.0
定义映射到外部的地址范围和名字
```

4. 建立映射关系
```shell
Router(config)# ip nat inside source list 10 pool abc
```



---

#### 4.2.4 动态NAPT配置




1. 定义内网接口和外网接口

```shell
Router(config)# interface fastethernet 0
Router(config-if)# ip nat outside

Router(config)# interface fastethernet 1
Router(config-if)# ip nat inside
```

2. 定义内部本地地址范围

```shell
Router(config)# access-list 10 permit 192.168.1.0 0.0.0.255
定义在内部进行NAPT的地址范围
```

3. 定义内部全局地址池

```shell
Router(config)# ip nat pool abc 200.8.7.3 200.8.7.5 netmask 255.255.255.0
定义映射到外部的地址范围和名字
```

4. 建立映射关系

```shell
Router(config)# ip nat inside source list 10 pool abc overload
```



---

### 4.3 NAT的监视和维护



显示信息的命令

```shell
show ip nat statistics   ---显示映射翻译的统计
```

```shell
show ip nat translations [verbose]   ---显示活动的映射翻译
```



清除状态的命令

```shell
clear ip nat translation *     ---从NAT转换表中清除所有动态地址转换项
```





---

### 4.5 关于NAT/NAPT的总结



NAT/NAPT大大解决了IPv4地址不足的问题，但同时也带来了一些问题。

* 影响网络性能
* 不能处理IP报头加密的报文
* 无法实现端到端的路径跟踪
* 内嵌IP地址等一些应用可能实现不了





## 5. 高级路由技术



第5章因为时间有限，和下面的实验就不更新了。







---

## 实验---历次实验讲解🤪

### 实验1.VLAN配置

请按照以下拓扑组网，实现不同VLAN隔离和相同VLAN间PC能够互访的目的。

请将两个交换机主机名命名为如下形式：班级+姓名缩写+交换机号，如：JSJ1-FZJ-SW1。

配置完后请在两个交换机分别输入：show version ;show vlan ;show interface trunk 三条命令，并上传结果截图。

![sy1.jpg](http://yanxuan.nosdn.127.net/2bd6dc332163d501d179258cecf4a9c6.jpg)













### 实验2.STP配置

在PT模拟器中按以下拓扑搭建网络环境，并进行以下配置：

1. 修改SwitchA的优先级为8192，指定其为根桥；

2. 配置rapid-pvst和pvst对比两者的收敛速度；

3. 在三台交换机上分别执行show spanning-tree命令，并截图提交。

![sy2.jpg](http://yanxuan.nosdn.127.net/f58461cb92388b220907cd3205c28145.jpg)











### 实验3.RIP配置

搭建下图网络拓扑和配置相关设备IP地址，在三个路由器上分别配置RIPv1和RIPv2，对比两个版本路由协议的区别。

要求提交三个路由器在配置RIPv1和RIPv2时输入“show ip route”命令查看路由表时的截图（共6张）。

![sy3.jpg](http://yanxuan.nosdn.127.net/1d4409c35404bd12dec9aba863b728da.jpg)













### 实验4.OSPF配置

请按照下图在Packet Tracker中搭建网络拓扑，并按要求为所有设备配置IP地址。

启用OSPF路由，实现拓扑中5个设备所连接的网络互通。

在5个设备上分别输入“show ip route ospf”并提交截图。

注意：所有设备按图示修改主机名，Lo是Loopback的简写

![sy4.jpg](http://yanxuan.nosdn.127.net/d0c4faa2dab0aaa91dc0e10aeb3be014.jpg)











### 实验5.扩展ACL配置

请按照下图在Packet Tracer中搭建网络拓扑，并完成以下配置：

1. 按图示配置相关设备的IP地址和VLAN；
2. 在三层设备上配置路由协议，实现全网互通；
3. 在RouterA上配置并应用扩展ACL，实现：VLAN10中的主机仅禁止访问Application Server上的ftp服务，VLAN20中的主机仅可以访问任意主机的www访问；
4. 在两台测试PC上进行操作产生相应的业务访问，并在RouterA上执行“show access-lists”查看规则匹配情况并截图提交（请特别注意，一定要产生相应的业务数据流，否则规则没有匹配记录）。

![sy5.jpg](http://yanxuan.nosdn.127.net/552509fb891bbaad7bc98085754e86a6.jpg)













### 实验6.NAT实验

请在Packet Tracer中打开附件中的PKT文件，在不更改相关设备接口和主机的IP配置情况下，在三个网络设备上进行合理的配置，达到以下要求：

1. 实现PC1和PC2同时访问互联网Web服务器
2. 实现互联网主机可以访问内网FTP服务器（注意：FTP服务器公网地址为210.43.224.10，另外外网仅可以访问ftp服务）
3. 在出口路由器上输入“show ip nat translations”命令并截图提交。

![sy6.png](http://yanxuan.nosdn.127.net/241c73f8c04ebfbf4c38ae2942e6cfac.png)









---

## 👾彩蛋---破解Cisco Packet  Tracer的登陆页面

首先，恭喜你读到了这里，你已经很厉害了！

然后，你能拿到这个PDF或者md，说明你肯定很善良！

以下内容，仅仅用于学习逆向知识，不得用于各种场合，严禁传播，不得恶意破坏软件，尊重原开发者的软件！！！

任何造成的违法行为，均与笔者无关！

---

[Cisco Packet  Tracer 下载的链接 ](https://itexamanswers.net/cisco-packet-tracer-latest-for-windows-linux-macos.html)

本次的实验环境是：虚拟机Windows10教育版，Cisco Packet Tracer的版本是 Windows64-setup-7.3.0 版本。

实验所用到的工具有：X64dbg。

![pj1.png](http://yanxuan.nosdn.127.net/85dcafc16ece3a839d43f8c08dc324c3.png)



首先，我们先打开这个软件。

![pj2.png](http://yanxuan.nosdn.127.net/2dbd0883db31c1da13615a4b27ab022a.png)

我们可以选择用户登陆或者游客登陆。而游客登陆需要等待10秒。

我们看一下当前的页面，可能是创建的一个窗口，或者弹窗，然后回调信息。

这里我们的思路有，直接将等待的10秒，设置为0，或者NOP掉这个弹窗，或者，直接屏蔽这个页面。

这里，我们使用的方法是：直接跳过这个页面。

因为，我们在点击游客登陆后，等待10秒，会跳转到主页面，所有我们可以直接让程序初始化的时候就跳转到主页面。

我们现在可以利用到的字符串有

1. netacad.com Login
2. User Login
3. Guest Login



我们先将软件用X64dbg打开

![pj3.png](http://yanxuan.nosdn.127.net/d38a5abcb11d74faba90e26d9110a19b.png)



然后，在搜索中选择所有模块，然后选择字符串引用，等待几分钟即可。

![pj4.PNG](http://yanxuan.nosdn.127.net/545212845d74113e6d604934af621342.PNG)



我们搜索 netacad.com Login 这个字符串，然后发现这些引用。

![pj5.png](http://yanxuan.nosdn.127.net/932f1accb11d52028f9e2cc1a64d5dd9.png)

我们可以看到第二个是我们在登陆窗口直接点 × 退出时，的一个弹窗上面的字符串。

所有这里我们就直接可以排除第二个，双击第一个，跳转到引用这个字符串的地址去。



然后我们来到了这里。

![pj6.png](http://yanxuan.nosdn.127.net/2da216b92745c303f409ac5d94f939d7.png)



我们在这个上下找一找，有没有上面跳转一类的。

![pj7.png](http://yanxuan.nosdn.127.net/ecb6f53c6812038fd7fbaa7faf495fdb.png)

发现有这些跳转，小跳转我们不需要理会（因为没有越过我们需要的字符串），我们看一下大跳转有两个，我们就一个一个的尝试。最后，我们发现是是 jne 这条指令是跳过前面登陆页面的 判断指令。我们直接双击这条汇编指令，进行修改。



![pj8.png](http://yanxuan.nosdn.127.net/aad84bde06f84e2995042fc879326aa1.png)



然后，可以在X64dbg里面运行来看一下，是否达到了我们实验的目的，也可以直接保存我们的修改后的代码。如果不保存的话，那么本次的修改效果只在当前的X64dbg里面有效。我们当然希望每次就直接双击进去打开软件，我们这个时候选择，补丁。

![pj9.png](http://yanxuan.nosdn.127.net/8c08285d9be581b2656aff9b02a1f680.png)



我们可以看到需要修改4个地方，我们点击补丁文件。这个时候要我们保存，我们当前的位置是Packettracer7.exe

所以，我们就保存Packettracer7.exe 这个名字

![pj10.png](http://yanxuan.nosdn.127.net/9c76a754b941eed74f0bef9774980599.png)





![pj11.png](http://yanxuan.nosdn.127.net/8f9c15a709809de59f39c6d972849522.png)



然后，我们把保存的文件，拖到 软件的\bin目录下，进行覆盖

![pj12.png](http://yanxuan.nosdn.127.net/5503c069877736b6b31cd028dff0c0ad.png)



我们，现在再打开的话，就没有登陆页面了。

至此，我们的破解就到这里结束了。

当然，在第一遍尝试时，会踩很多的坑，但是人都是在失败中成长的。

一次一次又一次，我相信没有解决不了的问题，只有意志不坚定的人。

---

